zhelezyaka/stm32-tft/trunk/User/ili9325.c
    IMAGE_LEFT = IMAGE_RIGHT = Points->X;
    IMAGE_TOP= IMAGE_BOTTOM = Points->Y;

    for(i = 1; i < PointCount; i++)
    {
        pixelX = POLY_X(i);
        if(pixelX < IMAGE_LEFT)
        {
            IMAGE_LEFT = pixelX;
        }
        if(pixelX > IMAGE_RIGHT)
        {
            IMAGE_RIGHT = pixelX;
        }

        pixelY = POLY_Y(i);
        if(pixelY < IMAGE_TOP)
        { 
            IMAGE_TOP = pixelY;
        }
        if(pixelY > IMAGE_BOTTOM)
        {
            IMAGE_BOTTOM = pixelY;
        }
    }
  
    LCD_SetTextColor(BackColor);  

    /*  Loop through the rows of the image. */
    for (pixelY = IMAGE_TOP; pixelY < IMAGE_BOTTOM; pixelY++) 
    {  
        /* Build a list of nodes. */
        nodes = 0; j = PointCount-1;

        for (i = 0; i < PointCount; i++) 
        {
            if (POLY_Y(i)<(double) pixelY && POLY_Y(j)>=(double) pixelY || POLY_Y(j)<(double) pixelY && POLY_Y(i)>=(double) pixelY) 
            {
                nodeX[nodes++]=(int) (POLY_X(i)+((pixelY-POLY_Y(i))*(POLY_X(j)-POLY_X(i)))/(POLY_Y(j)-POLY_Y(i))); 
            }
            j = i; 
        }
  
        /* Sort the nodes, via a simple "Bubble" sort. */
        i = 0;
        while (i < nodes-1) 
        {
            if (nodeX[i]>nodeX[i+1]) 
            {
                swap = nodeX[i]; 
                nodeX[i] = nodeX[i+1]; 
                nodeX[i+1] = swap; 
                if(i)
                {
                    i--; 
                }
            }
            else 
            {
                i++;
            }
        }
  
        /*  Fill the pixels between node pairs. */
        for (i = 0; i < nodes; i+=2) 
        {
            if(nodeX[i] >= IMAGE_RIGHT) 
            {
              break;
            }
            if(nodeX[i+1] > IMAGE_LEFT) 
            {
                if (nodeX[i] < IMAGE_LEFT)
                {
                    nodeX[i]=IMAGE_LEFT;
                }
                if(nodeX[i+1] > IMAGE_RIGHT)
                {
                    nodeX[i+1] = IMAGE_RIGHT;
                }
                LCD_SetTextColor(BackColor);
                LCD_DrawLine(pixelY, nodeX[i+1], nodeX[i+1] - nodeX[i], LCD_DIR_HORIZONTAL);
                LCD_SetTextColor(TextColor);
                PutPixel(pixelY, nodeX[i+1]);
                PutPixel(pixelY, nodeX[i]);
                /* for (j=nodeX[i]; j<nodeX[i+1]; j++) PutPixel(j,pixelY); */
          }
        }
    } 

    /* draw the edges */
    LCD_SetTextColor(TextColor);
}

/**
  * @brief  Writes to the selected LCD register.
  * @param  lcdReg: address of the selected register.
  * @param  lcdRegValue: value to write to the selected register.
  * @retval None
  */
void LCD_WriteReg(uint8_t lcdReg, uint16_t lcdRegValue)
{
    /* Write 16-bit Index, then Write Reg */
    ili9325_REG = lcdReg;
    ili9325_RAM = lcdRegValue;
}


/**
  * @brief  Reads the selected LCD Register.
  * @param  lcdReg: address of the selected register.
  * @retval LCD Register Value.
  */
uint16_t LCD_ReadReg(uint8_t lcdReg)
{
    /* Write 16-bit Index (then Read Reg) */
    ili9325_REG = lcdReg;
    return (ili9325_RAM);
}


/**
  * @brief  Prepare to write to the LCD RAM.
  * @param  None
  * @retval None
  */
void LCD_WriteRAM_Prepare(void)
{
    ili9325_REG = LCD_REG_34;
}


/**
  * @brief  Writes to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAM(uint16_t RGB_Code)
{
    /* Write 16-bit GRAM Reg */
    ili9325_RAM = RGB_Code;
}


/**
  * @brief  Reads the LCD RAM.
  * @param  None
  * @retval LCD RAM Value.
  */
uint16_t LCD_ReadRAM(void)
{
    /* Write 16-bit Index (then Read Reg) */
    ili9325_REG = LCD_REG_34; /* Select GRAM Reg */
    /* Read 16-bit Reg */
    return ili9325_RAM;
}


/**
  * @brief  Power on the LCD.
  * @param  None
  * @retval None
  */
void LCD_PowerOn(void)
{
    /* Power On sequence ---------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_16, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(LCD_REG_17, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LCD_WriteReg(LCD_REG_18, 0x0000); /* VREG1OUT voltage */
    LCD_WriteReg(LCD_REG_19, 0x0000); /* VDV[4:0] for VCOM amplitude*/
    _delay_(20);                     /* Dis-charge capacitor power voltage (200ms) */
    LCD_WriteReg(LCD_REG_16, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(LCD_REG_17, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
    _delay_(5);                      /* Delay 50 ms */
    LCD_WriteReg(LCD_REG_18, 0x0139); /* VREG1OUT voltage */
    _delay_(5);                      /* Delay 50 ms */
    LCD_WriteReg(LCD_REG_19, 0x1d00); /* VDV[4:0] for VCOM amplitude */
    LCD_WriteReg(LCD_REG_41, 0x0013); /* VCM[4:0] for VCOMH */
    _delay_(5);                      /* Delay 50 ms */
    LCD_WriteReg(LCD_REG_7, 0x0173);  /* 262K color and display ON */
}


/**
  * @brief  Enables the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOn(void)
{
    /* Display On */
    LCD_WriteReg(LCD_REG_7, 0x0173); /* 262K color and display ON */
}


/**
  * @brief  Disables the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOff(void)
{
    /* Display Off */
    LCD_WriteReg(LCD_REG_7, 0x0); 
}

/**
  * @brief  Configures LCD Control lines (FSMC Pins) in alternate function mode.
  * @param  None
  * @retval None
  */
void LCD_CtrlLinesConfig(void)
{
    GPIO_InitTypeDef gpioSt;
  
    // RCC使能FSMC的时钟直接来自AHB时钟, 也就是HCLK, 中间没有分频. 控制位是RCC_AHBENR中的FSMCEN位
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC, ENABLE);
    // GPIO端口和AFIO端口时钟来自APB2, 也就是PCLK2, 控制位是RCC_APB2ERN中的IOPxEN 和AFIOEN位
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE | RCC_APB2Periph_GPIOD, ENABLE); 
                             
    gpioSt.GPIO_Mode = GPIO_Mode_Out_PP;
    gpioSt.GPIO_Speed = GPIO_Speed_50MHz;              
    gpioSt.GPIO_Pin = GPIO_Pin_0;         //LCD 背光控制
    GPIO_Init(GPIOE, &gpioSt);

    gpioSt.GPIO_Pin = GPIO_Pin_1 ;        //LCD-RST
    GPIO_Init(GPIOE, &gpioSt);      

    // Set PD.00(D2), PD.01(D3), PD.04(NOE/RD), PD.05(NWE/WR), PD.08(D13), PD.09(D14),
    // PD.10(D15), PD.14(D0), PD.15(D1) as alternate function push pull      
    gpioSt.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 |
                                GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
    gpioSt.GPIO_Speed = GPIO_Speed_50MHz;
    gpioSt.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOD, &gpioSt);

