zhelezyaka/stm32-tft/trunk/User/ili9325.c
    // Set PE.07(D4), PE.08(D5), PE.09(D6), PE.10(D7), PE.11(D8), PE.12(D9), PE.13(D10),
    // PE.14(D11), PE.15(D12) as alternate function push pull 
    gpioSt.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | 
                                GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
    GPIO_Init(GPIOE, &gpioSt); 

    // CS 为FSMC_NE1(PD7) 
    gpioSt.GPIO_Pin = GPIO_Pin_7; 
    GPIO_Init(GPIOD, &gpioSt);

    // RS 为FSMC_A16(PD11)
    gpioSt.GPIO_Pin = GPIO_Pin_11 ; 
    GPIO_Init(GPIOD, &gpioSt); 

    GPIO_SetBits(GPIOD, GPIO_Pin_7);            //CS=1 
    GPIO_SetBits(GPIOD, GPIO_Pin_11);           //RS=1
    GPIO_SetBits(GPIOD, GPIO_Pin_14| GPIO_Pin_15 |GPIO_Pin_0 | GPIO_Pin_1);       
    GPIO_SetBits(GPIOE, GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10);   
    GPIO_SetBits(GPIOE, GPIO_Pin_0);            //LIGHT off
    GPIO_SetBits(GPIOE, GPIO_Pin_1);            //RESET=1
    GPIO_SetBits(GPIOD, GPIO_Pin_4);            //RD=1
    GPIO_SetBits(GPIOD, GPIO_Pin_5);            //WR=1
}

/**
  * @brief  Configures the Parallel interface (FSMC) for LCD(Parallel mode)
  * @param  None
  * @retval None
  */
void LCD_FSMCConfig(void)
{
    FSMC_NORSRAMInitTypeDef  fsmcTy;
    FSMC_NORSRAMTimingInitTypeDef  p;
    /*-- FSMC Configuration ------------------------------------------------------*/
    /*----------------------- SRAM Bank 1 ----------------------------------------*/
    /* FSMC_Bank1_NORSRAM4 configuration */
    p.FSMC_AddressSetupTime = 1;
    p.FSMC_AddressHoldTime = 0;
    p.FSMC_DataSetupTime = 2;
    p.FSMC_BusTurnAroundDuration = 0;
    p.FSMC_CLKDivision = 0;
    p.FSMC_DataLatency = 0;
    p.FSMC_AccessMode = FSMC_AccessMode_A;
    /* Color LCD configuration ------------------------------------
     LCD configured as follow:
        - Data/Address MUX = Disable
        - Memory Type = SRAM
        - Data Width = 16bit
        - Write Operation = Enable
        - Extended Mode = Enable
        - Asynchronous Wait = Disable */
    fsmcTy.FSMC_Bank = FSMC_Bank1_NORSRAM1;
    fsmcTy.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
    fsmcTy.FSMC_MemoryType = FSMC_MemoryType_SRAM;
    fsmcTy.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;
    fsmcTy.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
    fsmcTy.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;
    fsmcTy.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
    fsmcTy.FSMC_WrapMode = FSMC_WrapMode_Disable;
    fsmcTy.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
    fsmcTy.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
    fsmcTy.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
    fsmcTy.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
    fsmcTy.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
    fsmcTy.FSMC_ReadWriteTimingStruct = &p;
    fsmcTy.FSMC_WriteTimingStruct = &p;
    FSMC_NORSRAMInit(&fsmcTy);  
    /* BANK 1 (of NOR/SRAM Bank) is enabled */
    FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);
}

/**
  * @brief  Displays a pixel.
  * @param  x: pixel x.
  * @param  y: pixel y.  
  * @retval None
  */
static void PutPixel(int16_t x, int16_t y)
{ 
    if(x < 0 || x > 239 || y < 0 || y > 319)
    {
        return;  
    }
    LCD_DrawLine(x, y, 1, LCD_DIR_HORIZONTAL);
}

/**
  * @brief  Reset LCD.
  * @retval None
  */
void LCD_Reset(void)
{
    GPIO_ResetBits(GPIOF, GPIO_Pin_1);
    sysTickDelay(50);					   
    GPIO_SetBits(GPIOF, GPIO_Pin_1 );		 	 
	sysTickDelay(50);	
    GPIO_ResetBits(GPIOD, GPIO_Pin_7);
}

/**
  * @brief  Turn on the light of LCD.
  * @retval None
  */
void LCD_LightOn(void)
{
    GPIO_SetBits(GPIOE, GPIO_Pin_0);
}

/**
  * @brief  Turn off the light of LCD.
  * @retval None
  */
void LCD_LightOff(void)
{
    GPIO_ResetBits(GPIOE, GPIO_Pin_0);
}

